
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Акт.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Акт.АдресНедвижимости,
	|	Акт.Дата,
	|	Акт.ИтоговаяСумма,
	|	Акт.Клиент,
	|	Акт.Клиент.Телефон как Телефон,
	|	Акт.Номер,
	|	Акт.ОтветственныйСотрудник,
	|	Акт.СписокУслуг.(
	|		НомерСтроки,
	|		ВидРаботы,
	|		Стоимость
	|	),
	|	Акт.РасходныеМатериалы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Акт КАК Акт
	|ГДЕ
	|	Акт.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокУслугШапка = Макет.ПолучитьОбласть("СписокУслугШапка");
	ОбластьСписокУслуг = Макет.ПолучитьОбласть("СписокУслуг");
	ОбластьРасходныеМатериалыШапка = Макет.ПолучитьОбласть("РасходныеМатериалыШапка");
	ОбластьРасходныеМатериалы = Макет.ПолучитьОбласть("РасходныеМатериалы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокУслугШапка);
		ВыборкаСписокУслуг = Выборка.СписокУслуг.Выбрать();
		Пока ВыборкаСписокУслуг.Следующий() Цикл
			ОбластьСписокУслуг.Параметры.Заполнить(ВыборкаСписокУслуг);
			ТабДок.Вывести(ОбластьСписокУслуг, ВыборкаСписокУслуг.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьРасходныеМатериалыШапка);
		ВыборкаРасходныеМатериалы = Выборка.РасходныеМатериалы.Выбрать();
		Пока ВыборкаРасходныеМатериалы.Следующий() Цикл
			ОбластьРасходныеМатериалы.Параметры.Заполнить(ВыборкаРасходныеМатериалы);
			ТабДок.Вывести(ОбластьРасходныеМатериалы, ВыборкаРасходныеМатериалы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура Печать1(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать1)
	Макет = Документы.Акт.ПолучитьМакет("Печать1");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Акт.АдресНедвижимости,
	|	Акт.Дата,
	|	Акт.ИтоговаяСумма,
	|	Акт.Клиент,
	|	Акт.Номер,
	|	Акт.ОтветственныйСотрудник,
	|	Акт.СписокУслуг.(
	|		НомерСтроки,
	|		ВидРаботы,
	|		Стоимость
	|	),
	|	Акт.РасходныеМатериалы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Акт КАК Акт
	|ГДЕ
	|	Акт.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокУслугШапка = Макет.ПолучитьОбласть("СписокУслугШапка");
	ОбластьСписокУслуг = Макет.ПолучитьОбласть("СписокУслуг");
	ОбластьРасходныеМатериалыШапка = Макет.ПолучитьОбласть("РасходныеМатериалыШапка");
	ОбластьРасходныеМатериалы = Макет.ПолучитьОбласть("РасходныеМатериалы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокУслугШапка);
		ВыборкаСписокУслуг = Выборка.СписокУслуг.Выбрать();
		Пока ВыборкаСписокУслуг.Следующий() Цикл
			ОбластьСписокУслуг.Параметры.Заполнить(ВыборкаСписокУслуг);
			ТабДок.Вывести(ОбластьСписокУслуг, ВыборкаСписокУслуг.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьРасходныеМатериалыШапка);
		ВыборкаРасходныеМатериалы = Выборка.РасходныеМатериалы.Выбрать();
		Пока ВыборкаРасходныеМатериалы.Следующий() Цикл
			ОбластьРасходныеМатериалы.Параметры.Заполнить(ВыборкаРасходныеМатериалы);
			ТабДок.Вывести(ОбластьРасходныеМатериалы, ВыборкаРасходныеМатериалы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
