//Уколов Владимир Никитич
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Доходы 
	Движения.Доходы.Записывать = Истина;
	Для Каждого ТекСтрокаСписокУслуг Из СписокУслуг Цикл
		Движение = Движения.Доходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокУслуг.ВидРаботы;
		Движение.Сотрудник = ОтветственныйСотрудник;
		Движение.Сумма = ТекСтрокаСписокУслуг.Стоимость;
	КонецЦикла;

	// регистр Доходы 
	Движения.Доходы.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеМатериалы Из РасходныеМатериалы Цикл
		Движение = Движения.Доходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаРасходныеМатериалы.Номенклатура;
		Движение.Сотрудник = ОтветственныйСотрудник;
		Движение.Сумма = ТекСтрокаРасходныеМатериалы.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Функция УзнатьОстатки(Граница)

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&Период,
		|			Номенклатура В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					АктРасходныеМатериалы.Номенклатура КАК Номенклатура
		|				ИЗ
		|					Документ.Акт.РасходныеМатериалы КАК АктРасходныеМатериалы
		|				ГДЕ
		|					АктРасходныеМатериалы.Ссылка = &Регистратор)) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Период", Граница);
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаВывода = СтрШаблон("Не хватает товара""%1"" в количестве %2 ",
		ВыборкаДетальныеЗаписи.Номенклатура, -ВыборкаДетальныеЗаписи.Количество);
		Сообщить(СтрокаВывода);
	КонецЦикла;      
	
	Если РезультатЗапроса.Пустой()=Ложь Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	

	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА



КонецФункции // УзнатьОстатки()
