 //Уколов Владимир Никитич
 &НаКлиенте
 Процедура РасходныеМатериалыЦенаПриИзменении(Элемент)
	 ПодсчетСуммы();
 КонецПроцедуры
 
 &НаКлиенте
 Процедура РасходныеМатериалыКоличествоПриИзменении(Элемент)
	 ПодсчетСуммы();
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ПодсчетСуммы()
	 ТекущийЭлемент.ТекущиеДанные.Сумма = ТекущийЭлемент.ТекущиеДанные.Количество * ТекущийЭлемент.ТекущиеДанные.Цена;
	 Объект.ИтоговаяСумма = Объект.СписокУслуг.Итог("Стоимость") + Объект.РасходныеМатериалы.Итог("Сумма"); 
 КонецПроцедуры


&НаКлиенте
 Процедура СписокУслугСтоимостьПриИзменении(Элемент)
	 Объект.ИтоговаяСумма = Объект.СписокУслуг.Итог("Стоимость") + Объект.РасходныеМатериалы.Итог("Сумма");
 КонецПроцедуры
 
