//Уколов Владимир Никитич
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
	Запрос.Текст= "ВЫБРАТЬ 
	| НедвижимостьКлиента.Наименование 
	|ИЗ 
	| Справочник.НедвижимостьКлиента КАК НедвижимостьКлиента 
	|ГДЕ 
	| НедвижимостьКлиента.Наименование = &Наименование"; 
	Поиск = Запрос.Выполнить().Выбрать(); 
	Пока Поиск.Следующий() Цикл 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У данной недвижимости уже есть владелец!";
		Сообщение.Сообщить();
		Отказ = Истина;
		
		Прервать; 
	КонецЦикла; 
КонецПроцедуры
