//Уколов Владимир Никитич
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого СтрокаСотрудника Из СписокСотрудников Цикл
		
		СтрокаСотрудника.Ставка = РегистрыСведений.СведенияОСотрудниках.
			ПолучитьСтавку(СтрокаСотрудника.Сотрудник, ЭтотОбъект.Дата, ЭтотОбъект.Должность);
		
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияИУдержания.Ставка;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.ПараметрРасчета = ТекСтрокаСписокСотрудников.Ставка;
	КонецЦикла; 
	
	Движения.Зарплата.Записать();
	Движения.Зарплата.Рассчитать()

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
